Repository: RayanceKing/CCZUHelper
Catalog: CCZUHelper/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

# account.confirm_delete
source: Confirm Account Deletion
ja: アカウント削除の確認
ko: 계정 삭제 확인
zh_hans: 确认注销账户
zh_hant: 確認註銷帳戶

# account.delete_account
source: Delete Account
ja: アカウント削除
ko: 계정 삭제
zh_hans: 注销账户
zh_hant: 註銷帳戶

# account.delete_confirm_message
source: Deleting your account will permanently remove your account and all related data. This action is irreversible. Are you sure you want to continue?
ja: アカウントを削除すると、アカウントと関連データがすべて永久に削除されます。この操作は元に戻せません。続行してもよろしいですか？
ko: 계정을 삭제하면 계정과 모든 관련 데이터가 영구적으로 삭제됩니다. 이 작업은 되돌릴 수 없습니다. 계속하시겠습니까?
zh_hans: 注销账户将永久删除您的账户和所有相关数据，此操作不可逆转。确定要继续吗？
zh_hant: 註銷帳戶將永久刪除您的帳戶和所有相關資料，此操作不可逆轉。確定要繼續嗎？

# account.delete_confirmation_message
source: Deleting your account will permanently remove your account and all related data. This action cannot be undone. Are you sure you want to continue?
ja: アカウントを削除すると、すべての関連データが永久に削除されます。この操作は取り消せません。続行しますか？
ko: 계정을 삭제하면 계정과 모든 관련 데이터가 영구적으로 삭제됩니다. 이 작업은 취소할 수 없습니다. 계속하시겠습니까?
zh_hans: 注销账户将永久删除您的账户和所有相关数据，此操作不可逆转。确定要继续吗？
zh_hant: 註銷賬戶將永久刪除您的賬戶和所有相關數據，此操作不可逆轉。確定要繼續嗎？

# account.delete_failed
source: Deletion Failed
ja: 削除に失敗しました
ko: 삭제 실패
zh_hans: 注销失败
zh_hant: 註銷失敗

# account.delete_warning
source: This action is irreversible and will permanently delete your account and all related data
ja: この操作は元に戻せません。アカウントと関連データがすべて永久に削除されます
ko: 이 작업은 되돌릴 수 없으며 계정과 모든 관련 데이터가 영구적으로 삭제됩니다
zh_hans: 此操作不可逆转，将永久删除您的账户和所有相关数据
zh_hant: 此操作不可逆轉，將永久刪除您的帳戶和所有相關資料

# account.delete_warning_message
source: This action is irreversible and will permanently delete your account and all related data
ja: この操作は取り消せません。アカウントと関連データがすべて永久に削除されます
ko: 이 작업은 되돌릴 수 없으며 계정과 모든 관련 데이터가 영구적으로 삭제됩니다
zh_hans: 此操作不可逆转，将永久删除您的账户和所有相关数据
zh_hant: 此操作不可逆轉，將永久刪除您的賬戶和所有相關數據

# account.info
source: Account Information
ja: アカウント情報
ko: 계정 정보
zh_hans: 账户信息
zh_hant: 帳戶資訊

# account.sync.auto_restore
source: Restoring account...
ja: アカウント
ko: 계정
zh_hans: 自动恢复账号中...
zh_hant: 自動恢複帳號中...

# account.sync.disabled
source: Account saved on this device only
ja: アカウント
ko: 계정
zh_hans: 账号仅保存在本设备
zh_hant: 帳號仅保存在本設備

# account.sync.enabled
source: Account synced to iCloud
ja: アカウント
ko: 계정
zh_hans: 账号已同步到iCloud
zh_hant: 帳號已同步到iCloud

# account.sync.restored
source: Account restored from iCloud
ja: アカウント
ko: 계정
zh_hans: 账号已从iCloud恢复
zh_hant: 帳號已從iCloud恢複

source: Add
ja: 追加
ko: 추가
zh_hans: 添加
zh_hant: 添加

# app.subtitle
source: Changzhou University Assistant
ja: 常州大学アシスタント
ko: 창저우 대학 도우미
zh_hans: 常州大学助手
zh_hant: 常州大學助手

source: Balance
ja: 残高
ko: 잔액
zh_hans: 余额
zh_hant: 餘額

# calendar.export_failed
source: Export Failed
ja: エクスポート
ko: 내보내기
zh_hans: 导出失败
zh_hant: 導出失敗

# calendar.export_to_ics
source: Export as ICS
ja: エクスポート
ko: 내보내기
zh_hans: 导出为ICS
zh_hant: 導出為ICS

# calendar.import_from_ics
source: Import from ICS File
ja: インポート
ko: 가져오기
zh_hans: 从ICS文件导入
zh_hant: 從ICS文件導入

# calendar.permission_denied
source: Please allow calendar access in System Settings
ja: 設定
ko: 설정
zh_hans: 请在系统设置中允许访问日历
zh_hant: 請在繫統設置中允许访问日歷

# calendar.sync_failed
source: Sync Failed
ja: 同期
ko: 동기화
zh_hans: 同步失败
zh_hant: 同步失敗

# calendar.sync_to_system
source: Sync Schedule to System Calendar
ja: 同期
ko: 동기화
zh_hans: 同步课表到系统日历
zh_hant: 同步課表到繫統日歷

# classroom.building
source: Building
ja: 教室棟
ko: 강의동
zh_hans: 教学楼
zh_hant: 教學樓

# classroom.capacity_format
source: Capacity %lld
ja: 定員 %lld
ko: 수용 인원 %lld
zh_hans: 容量 %lld
zh_hant: 容量 %lld

# classroom.query
source: Query
ja: 検索
ko: 검색
zh_hans: 查询
zh_hant: 查詢

# classroom.search_conditions
source: Search Criteria
ja: 検索条件
ko: 검색 조건
zh_hans: 查询条件
zh_hant: 查詢条件

# classroom.select_conditions
source: Please select search criteria
ja: 選択してください検索条件
ko: 선택하세요검색 조건
zh_hans: 请选择查询条件
zh_hant: 請選擇查詢条件

# classroom.select_hint
source: Select building and time, then click query button
ja: 時間
ko: 시간
zh_hans: 选择教学楼、时间后点击查询按钮
zh_hant: 選擇教學樓、時間后點擊查詢按钮

# classroom.time
source: Time
ja: 時間
ko: 시간
zh_hans: 时间
zh_hant: 時間

# classroom.title
source: Empty Classroom
ja: 空き教室
ko: 빈교실
zh_hans: 空闲教室
zh_hant: 空閒教室

# classroom.weekday
source: Weekday
ja: 週
ko: 주
zh_hans: 星期
zh_hant: 星期

# comment.cancel_anonymous
source: Cancel Anonymous
ja: 匿名をキャンセル
ko: 익명 취소
zh_hans: 取消匿名
zh_hant: 取消匿名

# comment.delete
source: Delete Comment
ja: 削除コメント
ko: 삭제댓글
zh_hans: 删除评论
zh_hant: 刪除評論

# comment.delete_label
source: Delete comment
ja: コメントを削除
ko: 댓글 삭제
zh_hans: 删除评论
zh_hant: 刪除評論

# comment.reply
source: Reply
ja: 返信
ko: 답글
zh_hans: 回复
zh_hant: 回複

# comment.set_anonymous
source: Set Anonymous
ja: 匿名に設定
ko: 익명으로 설정
zh_hans: 设为匿名
zh_hant: 設為匿名

# common.all
source: All
ja: すべて
ko: 전체
zh_hans: 全部
zh_hant: 全部

# common.and
source: and
ja: と
ko: 및
zh_hans: 和
zh_hant: 和

# common.anonymous_user
source: Anonymous User
ja: 匿名ユーザー
ko: 익명 사용자
zh_hans: 匿名用户
zh_hant: 匿名用戶

# common.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# common.close
source: Close
ja: 閉じる
ko: 닫기
zh_hans: 关闭
zh_hant: 關閉

# common.completed
source: Completed
ja: 完了
ko: 완료
zh_hans: 完成
zh_hant: 完成

# common.date
source: Date
ja: 日付
ko: 날짜
zh_hans: 日期
zh_hant: 日期

# common.delete
source: Delete
ja: 削除
ko: 삭제
zh_hans: 删除
zh_hant: 刪除

# common.done
source: Done
ja: 完了
ko: 完료
zh_hans: 完成
zh_hant: 完成

# common.error
source: Error
ja: エラー
ko: 오류
zh_hans: 错误
zh_hant: 錯誤

# common.ignore
source: Ignore
ja: 無視
ko: 무시
zh_hans: 忽略
zh_hant: 忽略

# common.loading
source: Loading...
ja: 読み込み中...
ko: 로딩 중...
zh_hans: 加载中...
zh_hant: 加載中...

# common.more
source: More
ja: もっと見る
ko: 더보기
zh_hans: 更多
zh_hant: 更多

# common.optional
source: Optional
ja: 任意
ko: 선택 사항
zh_hans: 可选
zh_hant: 可選

# common.refresh
source: Refresh
ja: 更新
ko: 새로고침
zh_hans: 刷新
zh_hant: 刷新

# common.retry
source: Retry
ja: 再試行
ko: 재시도
zh_hans: 重试
zh_hant: 重試

# common.select_all
source: Select All
ja: すべて選択
ko: 모두 선택
zh_hans: 全选
zh_hant: 全選

# common.settings
source: Settings...
ja: 設定...
ko: 설정...
zh_hans: 设置...
zh_hant: 設定...

# common.unknown
source: Unknown
ja: 不明
ko: 알 수 없음
zh_hans: 未知
zh_hant: 未知

# common.user
source: User
ja: ユーザー
ko: 사용자
zh_hans: 用户
zh_hant: 用戶

# competition.deadline
source: Deadline
ja: 締切日
ko: 마감일
zh_hans: 截止日期
zh_hant: 截止日期

# competition.detail.no_content
source: No detail content
ja: 詳細内容はありません
ko: 상세 내용이 없습니다
zh_hans: 暂无详情内容
zh_hant: 暂无详情內容

# competition.detail.title
source: Competition Detail
ja: コンテスト詳細
ko: 대회 상세 정보
zh_hans: 竞赛详情
zh_hant: 競賽详情

# competition.empty
source: No competitions
ja: コンテストがありません
ko: 콘테스트 데이터 없음
zh_hans: 暂无竞赛数据
zh_hant: 暂无競賽數據

# competition.empty_hint
source: No competitions match your search
ja: 検索条件に一致するコンテストはありません
ko: 현재 일치하는 경쟁 정보가 없습니다.
zh_hans: 当前没有匹配的竞赛信息
zh_hant: 當前没有匹配的競賽信息

# competition.filter.category
source: Category
ja: カテゴリー
ko: 카테고리
zh_hans: 分类
zh_hant: 分類

# competition.filter.college
source: College
ja: 学院
ko: 학원
zh_hans: 学院
zh_hant: 學院

# competition.filter.level
source: Level
ja: レベル
ko: 등급
zh_hans: 级别
zh_hant: 級別

# competition.filter.reset
source: Reset Filters
ja: フィルターをリセット
ko: 필터 재설정
zh_hans: 重置筛选
zh_hant: 重置篩選

# competition.loading_failed
source: Failed to load competitions
ja: 読み込み竞赛数据失敗
ko: 경기 정보를 로드하지 못했습니다.
zh_hans: 加载竞赛数据失败
zh_hant: 加載競賽數據失敗

# competition.open_original
source: Open Original
ja: 原文を開く
ko: 원문 확인
zh_hans: 查看原文
zh_hant: 查看原文

# competition.organizer
source: Organizer
ja: 主催者
ko: 주최
zh_hans: 组织单位
zh_hant: 組織單位

# competition.publish_date
source: Published
ja: 公開日
ko: 게시날짜
zh_hans: 发布日期
zh_hant: 發佈日期

# competition.search.placeholder
source: Search by title, college, category, or level
ja: タイトル・学院・分類・レベルで検索
ko: 제목, 단과대, 분류 또는 등급으로 검색
zh_hans: 搜索竞赛标题、学院、分类或级别
zh_hant: 搜索競賽標題、學院、分類或級別

source: Confirm
ja: 確認
ko: 확인
zh_hans: 确认
zh_hant: 確認

# course_selection.available_format
source: Available %lld/%lld
ja: 空き %lld/%lld
ko: 선택 가능 %lld/%lld
zh_hans: 可选 %lld/%lld
zh_hant: 可選 %lld/%lld

# course_selection.capacity_format
source: Capacity %lld
ja: 定員 %lld
ko: 정원 %lld
zh_hans: 容量 %lld
zh_hant: 容量 %lld

# course_selection.category_label
source: Category
ja: カテゴリー
ko: 카테고리
zh_hans: 课程类别
zh_hant: 課程類別

# course_selection.drop
source: Drop Course
ja: 履修取消
ko: 수강 취소
zh_hans: 退选
zh_hant: 退選

# course_selection.drop_all
source: Deselect all
ja: 退选すべて
ko: 退选전체
zh_hans: 退选全部
zh_hant: 退選全部

# course_selection.drop_all_confirm_message
source: Are you sure you want to drop all selected courses?
ja: 選択したすべての科目の履修を取り消しますか？
ko: 선택한 모든 과목을 취소하시겠습니까?
zh_hans: 确认退选所有已选课程吗？此操作可能不可撤销。
zh_hant: 確認退選所有已選課程吗？此操作可能不可撤銷。

# course_selection.drop_all_confirm_title
source: Drop All Courses
ja: すべての科目を取り消す
ko: 모든 과목 취소
zh_hans: 退选所有已选课程
zh_hant: 退選所有已選課程

# course_selection.general_drop
source: Drop General Education Course
ja: 教養科目の履修取消
ko: 교양 과목 취소
zh_hans: 退选已选通识课
zh_hant: 退選已選通识課

# course_selection.general_drop_confirm_message
source: Are you sure you want to drop this general education course?
ja: この教養科目の履修を取り消しますか？
ko: 이 교양 과목을 취소하시겠습니까?
zh_hans: 此操作会退掉您已选的通识类课程，确认继续吗？
zh_hant: 此操作会退掉您已選的通识類課程，確認繼續吗？

# course_selection.general_drop_confirm_title
source: Confirm Drop
ja: 取消の確認
ko: 취소 확인
zh_hans: 确定退选已选的通识课吗？
zh_hant: 確定退選已選的通识課吗？

# course_selection.general_load_failed
source: Failed to load general education courses
ja: 教養科目の読み込みに失敗しました
ko: 교양 과목을 불러오지 못했습니다
zh_hans: 加载通识课失败
zh_hant: 加載通识課失敗

# course_selection.get_selected_general_failed
source: [WARN] Failed to get selected general courses: %@
ja: [WARN] 選択済み教養科目の取得に失敗しました: %@
ko: [WARN] 선택한 교양 과목을 가져오지 못했습니다: %@
zh_hans: [WARN] 获取已选通识课程失败: %@
zh_hant: [WARN] 獲取已選通識課程失敗: %@

# course_selection.learn_mode_label
source: Learning Mode
ja: 学習モード
ko: 학습 모드
zh_hans: 上课形式
zh_hant: 上課形式

# course_selection.learn_mode_picker
source: Select Learning Mode
ja: 学習モードを選択
ko: 학습 모드 선택
zh_hans: 筛选上课形式
zh_hant: 篩選上課形式

# course_selection.load_failed
source: Failed to load courses
ja: 科目の読み込みに失敗しました
ko: 과목을 불러오지 못했습니다
zh_hans: 加载失败
zh_hant: 加載失敗

# course_selection.loading_failed
source: Loading Failed
ja: 読み込み失敗
ko: 로딩 실패
zh_hans: 加载失败
zh_hant: 加載失敗

# course_selection.mode_picker
source: Course Type
ja: 科目タイプ
ko: 과목 유형
zh_hans: 选择模式
zh_hant: 選擇模式

# course_selection.mode.elective
source: Elective Courses
ja: 選択科目
ko: 선택 과목
zh_hans: 抢课
zh_hant: 抢課

# course_selection.mode.general
source: General Education
ja: 教養科目
ko: 교양 과목
zh_hans: 通识课
zh_hant: 通识課

# course_selection.no_general_courses
source: No general education courses selected
ja: 教養科目が選択されていません
ko: 교양 과목을 선택하지 않았습니다
zh_hans: 未选通识课
zh_hant: 未選通識課

# course_selection.no_general_selected
source: No general education courses selected
ja: 教養科目が選択されていません
ko: 선택된 교양 과목이 없습니다
zh_hans: 当前没有已选的通识课
zh_hant: 當前没有已選的通识課

# course_selection.optional_format
source: Optional %lld/%lld
ja: 任意 %lld/%lld
ko: 선택 %lld/%lld
zh_hans: 可选 %lld/%lld
zh_hant: 可選 %lld/%lld

# course_selection.please_select
source: Please select
ja: 選択してください
ko: 선택하세요
zh_hans: 请先选择课程
zh_hant: 請先選擇課程

# course_selection.please_select_courses
source: Please select courses first
ja: まず科目を選択してください
ko: 먼저 과목을 선택하세요
zh_hans: 请先选择课程
zh_hant: 請先選擇課程

# course_selection.search_placeholder
source: Search courses, teachers or course code
ja: コース
ko: 과목
zh_hans: 搜索课程、教师或课程代码
zh_hant: 搜索課程、教師或課程代碼

# course_selection.search_prompt
source: Search for courses
ja: 科目を検索
ko: 과목 검색
zh_hans: 搜索课程、教师或课程代码
zh_hant: 搜索課程、教師或課程代碼

# course_selection.search_prompt_general
source: Search general education courses
ja: 教養科目を検索
ko: 교양 과목 검색
zh_hans: 搜索通识课程或教师
zh_hant: 搜索通识課程或教師

# course_selection.selected
source: Selected
ja: 選択済み
ko: 선택됨
zh_hans: 已选
zh_hant: 已選

# course_selection.selected_courses
source: Selected Courses
ja: コース
ko: 과목
zh_hans: 已选课程
zh_hant: 已選課程

# course_selection.slot_format
source: Period: %lld-%lld
ja: 時限:%lld-%lld
ko: 교시:%lld-%lld
zh_hans: 节次:%lld-%lld
zh_hant: 節次:%lld-%lld

source: Course Selection System
ja: 履修登録システム
ko: 수강 신청 시스템
zh_hans: 选课系统
zh_hant: 選課系統

# course_selection.title
source: Course Selection
ja: 履修登録
ko: 수강 신청
zh_hans: 选课系统
zh_hant: 選課繫統

# course_selection.week_format
source: Week: %@
ja: 週:%@
ko: 주차:%@
zh_hans: 周次:%@
zh_hant: 周次:%@

# course.available
source: Available
ja: 選択可能
ko: 선택 가능
zh_hans: 可选
zh_hant: 可選

# course.available_format
source: Available %d/%d
ja: 選択可能 %d/%d
ko: 선택 가능 %d/%d
zh_hans: 可选 %d/%d
zh_hant: 可選 %d/%d

# course.capacity_format
source: Capacity %d
ja: 定員 %d
ko: 정원 %d
zh_hans: 容量 %d
zh_hant: 容量 %d

# course.category.elective
source: Elective Course
ja: 選択科目
ko: 선택 과목
zh_hans: 选修课
zh_hant: 選修課

# course.category.general
source: General Education
ja: 一般教養科目
ko: 교양 과목
zh_hans: 通识课
zh_hant: 通識課

# course.category.major
source: Major Course
ja: 専門科目
ko: 전공 과목
zh_hans: 专业课
zh_hant: 專業課

# course.category.required
source: Required
ja: 必修科目
ko: 필수 과목
zh_hans: 必修课
zh_hant: 必修課

# course.credits_format
source: ) Credits
ja: ) 単位
ko: ) 학점
zh_hans: ) 学分
zh_hant: ) 學分

# course.filter.available
source: Available
ja: 選択可能
ko: 선택 가능
zh_hans: 可选
zh_hant: 可選

# course.learn_mode.offline
source: Offline
ja: オフライン
ko: 오프라인
zh_hans: 线下
zh_hant: 線下

# course.learn_mode.online
source: Online
ja: オンライン
ko: 온라인
zh_hans: 线上
zh_hant: 線上

# course.online_learning
source: Online Learning
ja: オンライン学習
ko: 온라인 학습
zh_hans: 在线学习
zh_hant: 在線學習

# course.period_format
source: Period: %@
ja: 時限:%@
ko: 교시:%@
zh_hans: 节次:%@
zh_hant: 節次:%@

# course.platform.zhihuishu
source: Zhihuishu
ja: 智慧樹
ko: 지후이슈
zh_hans: 智慧树
zh_hant: 智慧樹

# course.selected
source: Selected
ja: 選択済み
ko: 선택됨
zh_hans: 已选
zh_hant: 已選

# course.week_format
source: Week: %@
ja: 週:%@
ko: 주차:%@
zh_hans: 周次:%@
zh_hant: 週次:%@

# create_post.alert_title
source: Notice
ja: ヒント
ko: 힌트
zh_hans: 提示
zh_hant: 提示

# create_post.anonymous
source: Post Anonymously
ja: 匿名で投稿
ko: 익명게시
zh_hans: 匿名发布
zh_hant: 匿名發佈

# create_post.anonymous_user
source: Anonymous
ja: 匿名ユーザー
ko: 익명 사용자
zh_hans: 匿名用户
zh_hant: 匿名用户

# create_post.category
source: Category
ja: カテゴリー
ko: 카테고리
zh_hans: 分类
zh_hant: 分類

# create_post.content
source: Content
ja: 内容
ko: 내용
zh_hans: 内容
zh_hant: 內容

# create_post.failed
source: Failed to publish: %@
ja: 投稿に失敗しました: %@
ko: 게시 실패: %@
zh_hans: 发布失败: %@
zh_hant: 發佈失敗: %@

# create_post.images
source: Images (Optional, max %d)
ja: 画像（任意、最大 %d 枚）
ko: 이미지(선택, 최대 %d장)
zh_hans: 图片（可选，最多%d张）
zh_hant: 圖片（可選，最多%d張）

# create_post.price
source: Price
ja: 価格
ko: 가격설정
zh_hans: 价格设置
zh_hant: 價格設置

# create_post.price_hint_unavailable
source: Non-trading posts are not available.
ja: 取引以外の投稿は利用できません。
ko: 거래 외 게시물은 이용할 수 없습니다.
zh_hans: 非交易帖不可用
zh_hant: 非交易帖不可用

# create_post.price_placeholder
source: Amount
ja: 金額
ko: 금액
zh_hans: 金额
zh_hant: 金额

# create_post.publish
source: Publish
ja: 公開
ko: 게시
zh_hans: 发布
zh_hant: 發佈

# create_post.publishing
source: Publishing
ja: 投稿中
ko: 게시 중
zh_hans: 正在发布
zh_hant: 正在發佈

# create_post.select_category
source: Select Category
ja: カテゴリを選択
ko: 카테고리 선택
zh_hans: 选择分类
zh_hant: 選擇分類

# create_post.success
source: Published successfully!
ja: 投稿に成功しました
ko: 게시성공！
zh_hans: 发布成功！
zh_hant: 發佈成功！

# create_post.test_notice
source: Posts will be visible to everyone after publishing
ja: 投稿後、すべてのユーザーに公開されます
ko: 게시 후 모든 사용자가 볼 수 있습니다
zh_hans: 帖子发布后所有人可见
zh_hant: 帖子發佈后所有人可見

# create_post.title
source: Create Post
ja: 投稿を作成
ko: 게시게시물
zh_hans: 发布帖子
zh_hant: 發佈帖子

# create_post.title_field
source: Title
ja: タイトル
ko: 제목
zh_hans: 标题
zh_hant: 標題

# create_post.title_placeholder
source: Enter title
ja: タイトルを入力
ko: 제목 입력
zh_hans: 请输入标题
zh_hant: 請輸入標題

# credit.format
source: %.1f Credits
ja: %.1f 単位
ko: %.1f 학점
zh_hans: %.1f 学分
zh_hant: %.1f 學分

# date_picker.confirm
source: Confirm
ja: OK
ko: 확인
zh_hans: 确定
zh_hant: 確認

# delete.confirm_post_format
source: Are you sure you want to delete the post "%@"? This action cannot be undone.
ja: 投稿「%@」を削除してもよろしいですか？この操作は元に戻せません。
ko: 게시물 "%@"을(를) 삭제하시겠습니까? 이 작업은 취소할 수 없습니다.
zh_hans: 确定要删除帖子"%@"吗？此操作不可撤销。
zh_hant: 確定要刪除帖子「%@」嗎？此操作不可撤銷。

# delete.confirm_post_message
source: Are you sure you want to delete the post "%@"? This action cannot be undone.
ja: 投稿"%@"を削除してもよろしいですか？この操作は取り消せません。
ko: 게시물 "%@"을(를) 삭제하시겠습니까? 이 작업은 취소할 수 없습니다.
zh_hans: 确定要删除帖子"%@"吗？此操作不可撤销。
zh_hant: 確定要刪除帖子"%@"嗎？此操作不可撤銷。

# delete.failed_format
source: Delete failed: %@
ja: 削除に失敗しました: %@
ko: 삭제 실패: %@
zh_hans: 删除失败: %@
zh_hant: 刪除失敗: %@

# electricity.error_not_logged_in
source: Please login first
ja: まずログインしてください
ko: 먼저 로그인해주세요
zh_hans: 请先登录
zh_hant: 請先登錄

# electricity.please_select
source: Please Select
ja: 選択してください
ko: 선택하세요
zh_hans: 请选择
zh_hant: 請選擇

# electricity.title
source: Electricity Query
ja: 電気料金照会
ko: 전기 요금 조회
zh_hans: 电费查询
zh_hant: 電費查詢

# error.duplicate_account
source: Error: You can only register one account per person. Please check your educational system information.
ja: エラー：1人につき1つのアカウントのみ登録できます。教務システムの情報を確認してください。
ko: 오류: 1인당 하나의 계정만 등록할 수 있습니다. 학사 시스템 정보를 확인하세요.
zh_hans: 错误：一个人仅能注册一个账户，请检查教务系统信息
zh_hant: 錯誤：一個人僅能註冊一個賬戶，請檢查教務系統信息

# error.format
source: Error: %@
ja: エラー: %@
ko: 오류: %@
zh_hans: 错误: %@
zh_hant: 錯誤: %@

# error.invalid_link
source: Invalid link, please try again later.
ja: 無効なリンクです。後でもう一度お試しください。
ko: 잘못된 링크입니다. 나중에 다시 시도하세요.
zh_hans: 链接无效，请稍后重试。
zh_hant: 鏈接無效，請稍後重試。

# error.missing_student_info
source: Unable to retrieve student information
ja: 学生情報を取得できません
ko: 학생 정보를 가져올 수 없습니다
zh_hans: 无法获取学生基本信息
zh_hant: 無法獲取學生基本信息

# error.missing_term
source: Unable to retrieve course selection term
ja: 履修学期を取得できません
ko: 수강 신청 학기를 가져올 수 없습니다
zh_hans: 无法获取选课学期
zh_hant: 無法獲取選課學期

# error.network
source: Network Error
ja: ネットワークエラー
ko: 네트워크 오류
zh_hans: 网络错误
zh_hant: 網絡錯誤

# error.please_login_first
source: Please login first
ja: まずログインしてください
ko: 먼저 로그인해주세요
zh_hans: 请先登录
zh_hant: 請先登錄

# error.sync_profile_failed
source: ⚠️ Failed to sync profile: %@
ja: ⚠️ プロフィールの同期に失敗しました: %@
ko: ⚠️ 프로필 동기화 실패: %@
zh_hans: ⚠️ 同步服务器资料失败: %@
zh_hant: ⚠️ 同步服務器資料失敗: %@

# error.timeout
source: Request timeout, please try again later
ja: 時間
ko: 시간
zh_hans: 请求超时，请稍后重试
zh_hant: 請求超時，請稍后重試

# error.unknown
source: Unknown Error
ja: 未知エラー
ko: 未知오류
zh_hans: 未知错误
zh_hant: 未知錯誤

# evaluation.all_evaluated
source: All courses have been evaluated
ja: コース
ko: 과목
zh_hans: 所有课程均已评价
zh_hant: 所有課程均已評價

# evaluation.attitude
source: Teacher's Attitude
ja: 教師
ko: 교사
zh_hans: 教师态度
zh_hant: 教師態度

# evaluation.content
source: Course Content
ja: コース
ko: 과목
zh_hans: 教学内容
zh_hant: 教學內容

# evaluation.default_comment
source: Great course, thank you teacher!
ja: コース
ko: 과목
zh_hans: 课程很好，感谢老师！
zh_hant: 課程很好，感谢老師！

# evaluation.error.fetch_failed
source: Failed to fetch courses: %@
ja: コース
ko: 과목
zh_hans: 获取课程列表失败: %@
zh_hant: 獲取課程列表失敗: %@

# evaluation.error.please_login
source: Please login first
ja: まずログインしてください
ko: 먼저 로그인해주세요
zh_hans: 请先登录
zh_hant: 請先登錄

# evaluation.evaluated_courses
source: Evaluated Courses
ja: コース
ko: 과목
zh_hans: 已评价课程
zh_hant: 已評價課程

# evaluation.form_title
source: Evaluate Course
ja: コース
ko: 과목
zh_hans: 评价课程
zh_hant: 評價課程

# evaluation.loading_failed
source: Loading Failed
ja: 読み込み失敗
ko: 로딩 실패
zh_hans: 加载失败
zh_hant: 加載失敗

# evaluation.no_courses
source: No Courses to Evaluate
ja: コース
ko: 과목
zh_hans: 暂无可评价的课程
zh_hant: 暂无可評價的課程

# evaluation.no_courses_desc
source: You don't have any courses to evaluate this semester
ja: コース
ko: 과목
zh_hans: 当前学期没有可评价的课程
zh_hant: 當前學期没有可評價的課程

# evaluation.pending_courses
source: Pending Courses
ja: コース
ko: 과목
zh_hans: 待评价课程
zh_hant: 待評價課程

# evaluation.title
source: Course Evaluation
ja: コース评价
ko: 강의 평가
zh_hans: 课程评价
zh_hant: 課程評價

# exam.edit.title
source: Edit Exam Schedule
ja: 試験日程
ko: 시험 일정
zh_hans: 编辑考试安排
zh_hant: 編輯考試安排

# exam.error.fetch_failed
source: Failed to fetch exam schedule: %@
ja: 試験日程
ko: 시험 일정
zh_hans: 获取考试安排失败: %@
zh_hant: 獲取考試安排失敗: %@

# exam.error.please_login
source: Please login first
ja: まずログインしてください
ko: 먼저 로그인해주세요
zh_hans: 请先登录
zh_hant: 請先登錄

# exam.error.timeout
source: Request timeout, teaching system may be unavailable
ja: 時間
ko: 시간
zh_hans: 请求超时，教务系统可能无法访问
zh_hant: 請求超時，教務繫統可能无法访问

# exam.loading_failed
source: Loading Failed
ja: 読み込み失敗
ko: 로딩 실패
zh_hans: 加载失败
zh_hant: 加載失敗

source: Exam Location
ja: 場所
ko: 장소
zh_hans: 考试地点
zh_hant: 考試地點

# exam.location.placeholder
source: Enter the exam location.
ja: 場所
ko: 장소
zh_hans: 键入考试地点
zh_hant: 鍵入考試地點

# exam.no_scheduled
source: No scheduled exams
ja: スケジュールがありません
ko: 일정이 없습니다
zh_hans: 暂无已安排的考试
zh_hant: 暂无已安排的考試

# exam.notification_body
source: Location: %@
ja: 試験地点：%@
ko: 장소
zh_hans: 考试地点：%@
zh_hant: 考試地點：%@

source: Exam Time
ja: 時間
ko: 시간
zh_hans: 考试时间
zh_hant: 考試時間

# exam.title
source: Exam Schedule
ja: 試験日程
ko: 시험 일정
zh_hans: 考试安排
zh_hant: 考試安排

# exam.week.format
source: Week %d, Slot %d-%d
ja: 第%d週 第%d-%d节
ko: 주
zh_hans: 第%d周 第%d-%d节
zh_hant: 第%d週 第%d-%d节

# forget.error
source: Error
ja: エラー
ko: 오류
zh_hans: 错误
zh_hant: 錯誤

# forget.error.unknown
source: Unknown error
ja: 未知エラー
ko: 未知오류
zh_hans: 未知错误
zh_hant: 未知錯誤

# forget.subtitle
source: Enter the email address associated with your account to continue.
ja: アカウント
ko: 계정
zh_hans: 输入账户使用的电子邮件地址以继续。
zh_hant: 輸入帳户使用的電子郵件地址以繼續。

# general.max_two_error
source: You can select a maximum of 2 general education courses
ja: 教養科目は最大2つまで選択できます
ko: 교양 과목은 최대 2개까지 선택할 수 있습니다
zh_hans: 通识课最多只能选择两门
zh_hant: 通识課最多只能選擇两門

# gpa.average
source: Average GPA
ja: 平均学分GPA
ko: 平均学分GPA
zh_hans: 平均学分绩点
zh_hant: 平均學分績點

# gpa.error.please_login
source: Please login first
ja: まずログインしてください
ko: 먼저 로그인해주세요
zh_hans: 请先登录
zh_hant: 請先登錄

# gpa.error.timeout
source: Request timeout, teaching system may be unavailable
ja: 時間
ko: 시간
zh_hans: 请求超时，教务系统可能无法访问
zh_hant: 請求超時，教務繫統可能无法访问

# gpa.loading_failed
source: Loading Failed
ja: 読み込み失敗
ko: 로딩 실패
zh_hans: 加载失败
zh_hant: 加載失敗

# gpa.student_id
source: Student ID
ja: 学生ID
ko: 학번
zh_hans: 学号
zh_hant: 學號

# gpa.title
source: Credits & GPA
ja: 学分GPA
ko: 学分GPA
zh_hans: 学分绩点
zh_hant: 學分績點

# grade.error.please_login
source: Please login first
ja: まずログインしてください
ko: 먼저 로그인해주세요
zh_hans: 请先登录
zh_hant: 請先登錄

# grade.error.timeout
source: Request timeout, teaching system may be unavailable
ja: 時間
ko: 시간
zh_hans: 请求超时，教务系统可能无法访问
zh_hant: 請求超時，教務繫統可能无法访问

# grade.loading_failed
source: Loading Failed
ja: 読み込み失敗
ko: 로딩 실패
zh_hans: 加载失败
zh_hant: 加載失敗

# grade.term
source: Term
ja: 学期
ko: 학기
zh_hans: 学期
zh_hant: 學期

# grade.title
source: Grade Query
ja: 成績照会
ko: 성적 조회
zh_hans: 成绩查询
zh_hant: 成績查詢

# image.crop.macos_not_supported
source: Interactive cropping is not supported on macOS
ja: macOSではインタラクティブなトリミングはサポートされていません
ko: macOS에서는 대화형 자르기가 지원되지 않습니다
zh_hans: macOS暂不支持交互式裁剪
zh_hant: macOS暫不支援互動式裁剪

# import_schedule.description
source: Import your course schedule from teaching system
ja: コース
ko: 과목
zh_hans: 从教务系统导入您的课程表
zh_hant: 從教務繫統導入您的課程表

# import_schedule.error
source: Error
ja: エラー
ko: 오류
zh_hans: 错误
zh_hant: 錯誤

# import_schedule.from_server
source: Import from Teaching System
ja: インポート
ko: 가져오기
zh_hans: 从教务系统导入
zh_hant: 從教務繫統導入

# import_schedule.go_login
source: Go to Login
ja: 前往ログイン
ko: 前往로그인
zh_hans: 前往登录
zh_hant: 前往登錄

# import_schedule.import_failed
source: Import failed: %@
ja: インポート
ko: 가져오기
zh_hans: 导入失败: %@
zh_hant: 導入失敗: %@

# import_schedule.not_logged_in
source: User not logged in
ja: ユーザー未ログイン
ko: 사용자未로그인
zh_hans: 用户未登录
zh_hant: 用户未登錄

# import_schedule.please_login
source: Please login first
ja: まずログインしてください账号
ko: 먼저 로그인해주세요账号
zh_hans: 请先登录账号
zh_hant: 請先登錄帳號

# import_schedule.please_login_error
source: Please login first
ja: まずログインしてください
ko: 먼저 로그인해주세요
zh_hans: 请先登录
zh_hant: 請先登錄

# import_schedule.title
source: Import Schedule
ja: インポート
ko: 가져오기
zh_hans: 导入课表
zh_hant: 導入課表

# intent.course_query.description
source: Query course information
ja: コース
ko: 과목
zh_hans: 查询课程信息
zh_hant: 查詢課程信息

# intent.course_query.param_name
source: Course Name
ja: コース
ko: 과목
zh_hans: 课程名称
zh_hant: 課程名称

# intent.course_query.title
source: Course Query
ja: コース
ko: 과목
zh_hans: 课程查询
zh_hant: 課程查詢

# intent.entity.course
source: Course
ja: コース
ko: 과목
zh_hans: 课程
zh_hant: 課程
